{
  "projects": [
    {
      "name": "NaymahHashmi.com V2 (In Progress) test",
      "description": "Re-designing and developing the portfolio website for an architect. With a few people working on the project, we decided to use agile methodologies, specifically Jira to be able to complete our work efficiently. The website itself will be full stack, planning to use MongoDB as our database. There will be an admin site, with authentication and security, to allow easy modifications of the website. So far, I have learned and became comfortable with agile methodologies, along with github for code editing.",
      "skills": "Vue, Typescript, MongoDB, HTML, CSS, Jira, GitHub",
      "Image": "naymahHashmi"
    },
    {
      "name": "Personal Portfolio",
      "description": "Personal portfolio built in Next.js and React.js. Valuable experience providing necessary practice using react along with components. Deployable now, but would like to make full stack in order to update content easily using an admin site. Deployed and hosted on Digital Ocean.",
      "skills": "React.js, Next.js, HTML, CSS, Typescipt",
      "Image": "portfolio"
    },
    {
      "name": "StudyBetter.",
      "description": "Working on ”Study Better,” a web application built in Vue, aimed at enhancing study productivity and implementing effective studying techniques for students. The application has a Pomodoro timer and spaced break timer to optimize study sessions and facilitate strategic breaks, improving focus and learning retention. Future developments includes todo-list, powerpoint navigator with a built in blurt technique using either manually scribed notes for the slide, or speech recognition. ",
      "skills": "Vue, Typescript, HTML, CSS, GitHub",
      "Image": "studybetter"
    },
    {
      "name": "Sneaker Alert",
      "description": "Twitter bot that went through specific twitter accounts to gather data about shoe releases. Stores that information in a csv file, using the pandas library, and the day before the shoe releases, tweets an alert stating that the shoe is going to release. Ran for 2 weeks (4 releases) and reached an audience of 90 people. Learned data gathering and analysis, along with experience working with api's to fetch and use data.",
      "skills": "Python, tweepy",
      "Image": "sneakerAlert"
    }
  ],
  "experience": [
    {
      "role": "Information Security Co-op",
      "description": "Worked as an information security co-op",
      "company": "Denso international"
    }
  ]
}